IlleniumDillon/MM32F5277/MM32/MM32_DMA1Reg.h
#ifndef _MM32_DMA1REG_H_
#define _MM32_DMA1REG_H_

#include "MM32_DMA1Regdef.h"

//DMA Interrupt Status Register
#define	DMA1_ISR		(*(MM32_DMA1_ISR*)(0x40020000+0x00))

//DMA Interrupt Flag Clear Register
#define	DMA1_IFCR		(*(MM32_DMA1_IFCR*)(0x40020000+0x04))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR1		(*(MM32_DMA1_CCR1*)(0x40020000+0x08))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR1		(*(MM32_DMA1_CNDTR1*)(0x40020000+0x0C))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR1		(*(MM32_DMA1_CPAR1*)(0x40020000+0x10))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR1		(*(MM32_DMA1_CMAR1*)(0x40020000+0x14))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR2		(*(MM32_DMA1_CCR2*)(0x40020000+0x1c))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR2		(*(MM32_DMA1_CNDTR2*)(0x40020000+0x20))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR2		(*(MM32_DMA1_CPAR2*)(0x40020000+0x24))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR2		(*(MM32_DMA1_CMAR2*)(0x40020000+0x28))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR3		(*(MM32_DMA1_CCR3*)(0x40020000+0x30))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR3		(*(MM32_DMA1_CNDTR3*)(0x40020000+0x34))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR3		(*(MM32_DMA1_CPAR3*)(0x40020000+0x38))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR3		(*(MM32_DMA1_CMAR3*)(0x40020000+0x3C))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR4		(*(MM32_DMA1_CCR4*)(0x40020000+0x44))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR4		(*(MM32_DMA1_CNDTR4*)(0x40020000+0x48))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR4		(*(MM32_DMA1_CPAR4*)(0x40020000+0x4C))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR4		(*(MM32_DMA1_CMAR4*)(0x40020000+0x50))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR5		(*(MM32_DMA1_CCR5*)(0x40020000+0x58))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR5		(*(MM32_DMA1_CNDTR5*)(0x40020000+0x5C))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR5		(*(MM32_DMA1_CPAR5*)(0x40020000+0x60))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR5		(*(MM32_DMA1_CMAR5*)(0x40020000+0x64))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR6		(*(MM32_DMA1_CCR6*)(0x40020000+0x6c))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR6		(*(MM32_DMA1_CNDTR6*)(0x40020000+0x70))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR6		(*(MM32_DMA1_CPAR6*)(0x40020000+0x74))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR6		(*(MM32_DMA1_CMAR6*)(0x40020000+0x78))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR7		(*(MM32_DMA1_CCR7*)(0x40020000+0x80))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR7		(*(MM32_DMA1_CNDTR7*)(0x40020000+0x84))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR7		(*(MM32_DMA1_CPAR7*)(0x40020000+0x88))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR7		(*(MM32_DMA1_CMAR7*)(0x40020000+0x8c))

//DMA Channel 1 Configuration Register
#define	DMA1_CCR8		(*(MM32_DMA1_CCR8*)(0x40020000+0x94))

//DMA Channel 1 Transfer Number Register
#define	DMA1_CNDTR8		(*(MM32_DMA1_CNDTR8*)(0x40020000+0x98))

//DMA Channel 1 Peripheral Address Register
#define	DMA1_CPAR8		(*(MM32_DMA1_CPAR8*)(0x40020000+0x9c))

//DMA Channel 1 Memory Address Register
#define	DMA1_CMAR8		(*(MM32_DMA1_CMAR8*)(0x40020000+0xA0))


#endif
